КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПеренаправитьНаФорму = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ПолноеИмяФормыЗаписиПоТипуДанных(
		Запись.ТипДанных);
	
	Если ЗначениеЗаполнено(ПеренаправитьНаФорму) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ТипДанных) Тогда
		
		ПараметрыПолей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ПараметрыПолейПоТипуДанных(Запись.ТипДанных);
		
		Для Счет = 1 По 3 Цикл
			ТекущийЭлемент = Элементы["Разрез" + Строка(Счет)];
			ДанныеПоля = ПараметрыПолей
			["Разрез" + Строка(Счет)];
			
			ТекущийЭлемент.Заголовок = ДанныеПоля.Заголовок;
		КонецЦикла;
		
		Элементы.Количество.Заголовок = ПараметрыПолей.Количество.Заголовок;
		Элементы.Дата.Заголовок = ПараметрыПолей.Дата.Заголовок;
		Элементы.Ответственный.Заголовок = ПараметрыПолей.Ответственный.Заголовок;
		Элементы.Реквизит1.Заголовок = ПараметрыПолей.Реквизит1.Заголовок;
		
		Если Запись.ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ Тогда
			ПЛТитул1 = Документы.КонтурЛогистика_ПЛ_Титул1.НайтиПоРеквизиту("kl_id", Запись.Разрез1);
		КонецЕсли;
		
		Элементы.ПЛТитул1.Видимость = ЗначениеЗаполнено(ПЛТитул1);
		
	КонецЕсли;
	
	ЭтоИННПартнеровEDI = Запись.ТипДанных
		= РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ИННПартнеровEDI;
	ЭтоТребованияПартнеров = Запись.ТипДанных
		= РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ТребованияПартнеров;
	Элементы.ПоказатьСохраненныеДанные.Видимость = ЭтоИННПартнеровEDI;
	Элементы.ОбновитьИзEDI.Видимость = ЭтоИННПартнеровEDI;
	Элементы.ОбновитьТребованияПартнеров.Видимость = ЭтоТребованияПартнеров;
	Элементы.ПоказатьJSON.Видимость = ЭтоТребованияПартнеров;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ПеренаправитьНаФорму) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписиДляПеренаправления());
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ПеренаправитьНаФорму,
		ПараметрыФормы,
		,
		ЭтаФорма);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСохраненныеДанные(Команда)
	
	ТабличныйДокумент = СформироватьТабличныйДокументСохраненныхДанныхИННПартнеровEDI();
	
	Если ТабличныйДокумент = Неопределено Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Сохраненные данные ИНН партнеров EDI отсутствуют или имеют неверный формат.");
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент.Показать("ИНН партнеров EDI");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзEDI(Команда)
	
	ПараметрыФЗ = Новый Структура;
	ПараметрыФЗ.Вставить("ТихийРежим", Истина);
	
	ПараметрыЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ПараметрыЗапускаФоновогоЗаданияВФормеФоновогоЗадания();
	ПараметрыЗапуска.ЗапуститьМетод = "КонтурЛогистика_ДлительныеОперацииСервер.ОбновитьВсеИННПартнеровEDI";
	ПараметрыЗапуска.КлючФоновогоЗадания = "КлючФЗ_ОбновитьВсеИННПартнеровEDI_Ручное";
	ПараметрыЗапуска.ПараметрыЗапускаемогоМетода = ПараметрыФЗ;
	ПараметрыЗапуска.ПредставлениеЗадачи = "Обновление кэша ИНН+КПП партнеров EDI";
	ПараметрыЗапуска.ЗакрытьПриУспешномВыполнении = Истина;
	ПараметрыЗапуска.ОтображатьПрогресс = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_ФоновоеЗадание",
		ПараметрыЗапуска,
		ЭтаФорма,
		ЭтаФорма,
		"ОбновитьИзEDIЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзEDIЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// EDI_КэшИННПартнеров() в модуле ПовтИсп — сбрасываем, чтобы следующий поиск взял свежие данные из РС.
	ОбновитьПовторноИспользуемыеЗначения();
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТребованияПартнеров(Команда)
	
	ПараметрыФЗ = Новый Структура;
	ПараметрыФЗ.Вставить("ТихийРежим", Истина);
	
	ПараметрыЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ПараметрыЗапускаФоновогоЗаданияВФормеФоновогоЗадания();
	ПараметрыЗапуска.ЗапуститьМетод = "КонтурЛогистика_ДлительныеОперацииСервер.ОбновитьТребованияПартнеров";
	ПараметрыЗапуска.КлючФоновогоЗадания = "КлючФЗ_ОбновитьТребованияПартнеров_Ручное";
	ПараметрыЗапуска.ПараметрыЗапускаемогоМетода = ПараметрыФЗ;
	ПараметрыЗапуска.ПредставлениеЗадачи = "Обновление требований торговых сетей";
	ПараметрыЗапуска.ЗакрытьПриУспешномВыполнении = Истина;
	ПараметрыЗапуска.ОтображатьПрогресс = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_ФоновоеЗадание",
		ПараметрыЗапуска,
		ЭтаФорма,
		ЭтаФорма,
		"ОбновитьТребованияПартнеровЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТребованияПартнеровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьПовторноИспользуемыеЗначения();
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьJSON(Команда)
	
	ТекстТребований = СформироватьТекстТребованийПартнеров();
	
	Если Не ЗначениеЗаполнено(ТекстТребований) Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Сохраненные требования партнеров отсутствуют или имеют неверный формат.");
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстТребований);
	ТекстовыйДокумент.Показать("Требования партнеров (JSON)");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КлючЗаписиДляПеренаправления()
	
	Возврат РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.КлючЗаписи(
		Запись.ОрганизацияДиадок,
		Запись.ТипДанных,
		Запись.Разрез1,
		Запись.Разрез2,
		Запись.Разрез3);
	
КонецФункции

&НаСервере
Функция СформироватьТабличныйДокументСохраненныхДанныхИННПартнеровEDI()
	
	ДанныеХранилище = ПолучитьДанныеХранилищеЗаписи();
	
	Если ДанныеХранилище = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Данные = ДанныеХранилище.Получить();
	
	Если ТипЗнч(Данные) <> Тип("ТаблицаЗначений") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокументРезультат = Новый ТабличныйДокумент;
	ТабличныйДокументРезультат.ТолькоПросмотр = Истина;
	ТабличныйДокументРезультат.ОтображатьЗаголовки = Ложь;
	ТабличныйДокументРезультат.ОтображатьСетку = Истина;
	
	НомерКолонки = 1;
	Для Каждого Колонка Из Данные.Колонки Цикл
		
		ТабличныйДокументРезультат.Область(1, НомерКолонки).Текст = Колонка.Имя;
		НомерКолонки = НомерКолонки + 1;
		
	КонецЦикла;
	
	НомерСтроки = 2;
	Для Каждого СтрокаДанных Из Данные Цикл
		
		НомерКолонки = 1;
		Для Каждого Колонка Из Данные.Колонки Цикл
			
			ТабличныйДокументРезультат.Область(НомерСтроки, НомерКолонки).Текст = Строка(СтрокаДанных[Колонка.Имя]);
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат ТабличныйДокументРезультат;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеХранилищеЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", Запись.ОрганизацияДиадок);
	Запрос.УстановитьПараметр("ТипДанных", Запись.ТипДанных);
	Запрос.УстановитьПараметр("Разрез1", Запись.Разрез1);
	Запрос.УстановитьПараметр("Разрез2", Запись.Разрез2);
	Запрос.УстановитьПараметр("Разрез3", Запись.Разрез3);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.ДанныеХранилище КАК ДанныеХранилище
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез1 = &Разрез1
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез3 = &Разрез3";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ДанныеХранилище;
	
КонецФункции

&НаСервере
Функция СформироватьТекстТребованийПартнеров()
	
	ДанныеХранилище = ПолучитьДанныеХранилищеЗаписи();
	
	Если ДанныеХранилище = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Данные = ДанныеХранилище.Получить();
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		Возврат КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(Данные);
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

#КонецОбласти
